{
  "subscription": [
    {
      "name": "Sandy",
      "email": "sandyzhang142@gmail.com",
      "id": 1
    }
  ],
  "saved": [
    {
      "image": "https://cdn.myanimelist.net/images/manga/1/157897l.webp",
      "title": "Berserk",
      "score": 9.46,
      "status": "Publishing",
      "chapters": null,
      "volumes": null,
      "author": [
        {
          "mal_id": 1868,
          "type": "people",
          "name": "Miura, Kentarou",
          "url": "https://myanimelist.net/people/1868/Kentarou_Miura"
        },
        {
          "mal_id": 49592,
          "type": "people",
          "name": "Studio Gaga",
          "url": "https://myanimelist.net/people/49592/Studio_Gaga"
        }
      ],
      "synopsis": "Guts, a former mercenary now known as the \"Black Swordsman,\" is out for revenge. After a tumultuous childhood, he finally finds someone he respects and believes he can trust, only to have everything fall apart when this person takes away everything important to Guts for the purpose of fulfilling his own desires. Now marked for death, Guts becomes condemned to a fate in which he is relentlessly pursued by demonic beings. Setting out on a dreadful quest riddled with misfortune, Guts, armed with a massive sword and monstrous strength, will let nothing stop him, not even death itself, until he is finally able to take the head of the one who stripped him—and his loved one—of their humanity. [Written by MAL Rewrite] Included one-shot: Volume 14: Berserk: The Prototype",
      "apiID": 2,
      "id": 1
    },
    {
      "image": "https://cdn.myanimelist.net/images/manga/2/250313l.webp",
      "title": "Hajime no Ippo",
      "score": 8.69,
      "status": "Publishing",
      "chapters": null,
      "volumes": null,
      "author": [
        {
          "mal_id": 1876,
          "type": "people",
          "name": "Morikawa, George",
          "url": "https://myanimelist.net/people/1876/George_Morikawa"
        }
      ],
      "synopsis": "Makunouchi Ippo is a 16-year-old high school student who helps his mother run the family business. His hefty workload impedes on his social life, making him an easy target for bullies. One day, while being beaten up by a group of high school students, Ippo is saved by a boxer named Mamoru Takamura, and is brought to the Kamogawa Boxing Gym. This afterschool bullying session turns his life around for the better as Ippo discovers his latent talent for boxing and decides to practice the sport professionally. However, Mamoru doubts Ippo's determination and assigns him a task deemed impossible to complete, but the resolute Ippo trains tirelessly to fulfill his mission. Along the way, he finds out what it means to attain true strength while making new friends and fighting formidable foes. [Written by MAL Rewrite]",
      "apiID": 7,
      "id": 2
    }
  ]
}